using System.Runtime.InteropServices;
using Tyuiu.RadchenkoAV.Sprint2.Task6.V10.Lib;
Console.Title = "Спринт #2| Выполнил: Радченко А. В. | РППБ-25-1";
Console.WriteLine("***************************************************************************");
Console.WriteLine("* Спринт #2                                                               *");
Console.WriteLine("* Тема: Создание итогового решения по спринту                             *");
Console.WriteLine("* Задание #5                                                              *");
Console.WriteLine("* Вариант #25                                                              *");
Console.WriteLine("* Выполнил: Радченко А. В.| РППБ-25-1                             *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                *");
Console.WriteLine("* Написать программу, которая вычисляет требуемое значение функции  с     *");
Console.WriteLine("* использованием тернарного оператора, где пользователь вводит значение   *");
Console.WriteLine("* переменных x,y с клавиатуры.                                            *"); 
Console.WriteLine("***************************************************************************");
DataService ds = new();
Console.WriteLine("Введите номер дня: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите номер месяца: ");
int m = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите номер года: ");
int g = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("Дата предыдущего дня: " + ds.FindDateOfPreviousDay(g, m, n));
Console.ReadKey();