using System.Runtime.InteropServices;
using Tyuiu.RadchenkoAV.Sprint2.Task3.V13.Lib;
Console.Title = "Спринт #2| Выполнил: Радченко А. В. | РППБ-25-1";
Console.WriteLine("***************************************************************************");
Console.WriteLine("* Спринт #3                                                               *");
Console.WriteLine("* Тема: Создание итогового решения по спринту                             *");
Console.WriteLine("* Задание #2                                                              *");
Console.WriteLine("* Вариант #25                                                              *");
Console.WriteLine("* Выполнил: Радченко А. В.| РППБ-25-1                             *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                *");
Console.WriteLine("*Написать программу, которая вычисляет требуемое значение функции Y с испо*");
Console.WriteLine("*ользованием вложенных оператор if-else, где пользователь вводит значение *");
Console.WriteLine("* переменной X с клавиатуры. Округлить полученное значение до трех знаков *");
Console.WriteLine("* после запятой;                                                          *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");
DataService ds = new DataService();
Console.WriteLine("Введите x:");
var x = Convert.ToDouble(Console.ReadLine());
var result = ds.Calculate(x);
Console.WriteLine(result);
Console.ReadKey();